Revit 2027 API
BuiltInFailures.SketchFailures.EndsNotOnCutFace Property
 Ends of the sketched loop do not lie on the boundary of the face being modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EndsNotOnCutFace { get; }
Public Shared ReadOnly Property EndsNotOnCutFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EndsNotOnCutFace {
	FailureDefinitionId^ get ();
}
static member EndsNotOnCutFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace